doe/remote_snapshot/openfoam_case_rans_doe_base/constant/combustionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}

combustionModel none;
